CSI API ETABS v1

# cView Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cView

    Public Interface cView

    Dim instance As cView

    public interface class cView

    type cView =  interface end

The cView type exposes the following members.

Methods

| Name| Description
---|---|---
|
RefreshView|  Refreshes the view
for the specified window(s).
|
RefreshWindow|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com